11/data/attachments/9eb7bed52c8c10e2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_04f8f895-f6fc-4df2-b9a3-58cd98de6d1c</nif:username>
            <nif:friendToBeAdded>Theresa_there_Friend_40964_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>